"""Table of Contents; (to be OR is) shortened for use in flashcard decks --- Arabic (ar)"""


'''   Edit the string between the `"""`s;                               Do not edit the original TOC text right of the `#`'''

TOC_LINES = [

    """ Magnifica Humanitas"""                                        , # Magnifica Humanitas
    """  _ المقدّمة"""                                                , # المقدّمة
    """   A. الشّؤون الجديدة في عصرنا"""                              , # الشّؤون الجديدة في عصرنا
    """   B. رمزان من الكتاب المقدّس"""                               , # رمزان من الكتاب المقدّس
    """   C. البناء في الخير"""                                       , # البناء في الخير
    """   D. يبقى كلّ واحد منّا إنسانًا"""                            , # يبقى كلّ واحد منّا إنسانًا

    """  C1. الفصل الأوّل: فكر ديناميكيّ مخلص للإنجيل"""              , # الفصل الأوّل: فكر ديناميكيّ مخلص للإنجيل
    """   A. كنيسة في مسيرة تاريخ البشريّة"""                         , # كنيسة في مسيرة تاريخ البشريّة
    """    1. حكمة الكلمة والحوار مع العلوم الإنسانيّة"""             , # حكمة الكلمة والحوار مع العلوم الإنسانيّة
    """    2. تعليم الكنيسة الاجتماعيّ هو تمييز للجماعة كلّها"""      , # تعليم الكنيسة الاجتماعيّ هو تمييز للجماعة كلّها
    """   B. تطوّر سُلطة تعليم الكنيسة الاجتماعيّ من البابا لاوُن الثّالث عشر حتّى اليوم""", # تطوّر سُلطة تعليم الكنيسة الاجتماعيّ من البابا لاوُن الثّالث عشر حتّى اليوم
    """    1. التّطوّرات الأولى لـ ”تعليم الكنيسة الاجتماعيّ“"""      , # التّطوّرات الأولى لـ ”تعليم الكنيسة الاجتماعيّ“
    """    2. سنوات المجمع الفاتيكانيّ الثّاني"""                     , # سنوات المجمع الفاتيكانيّ الثّاني
    """    3. سُلطة الكنيسة التّعليميّة حاليًّا"""                    , # سُلطة الكنيسة التّعليميّة حاليًّا
    """    4. قراءة التّاريخ في نور الإيمان"""                        , # قراءة التّاريخ في نور الإيمان

    """  C2. الفصل الثّاني: أسس ومبادئ تعليم الكنيسة الاجتماعيّ"""    , # الفصل الثّاني: أسس ومبادئ تعليم الكنيسة الاجتماعيّ
    """   A. أسس التّعليم الاجتماعيّ"""                               , # أسس التّعليم الاجتماعيّ
    """    1. الإنسان صورة الله الثّالوث"""                           , # الإنسان صورة الله الثّالوث
    """    2. المساواة في الكرامة بين جميع البشر"""                   , # المساواة في الكرامة بين جميع البشر
    """    3. القيمة السّامية لحقوق الإنسان"""                        , # القيمة السّامية لحقوق الإنسان
    """   B. مبادئ التّعليم الاجتماعيّ"""                             , # مبادئ التّعليم الاجتماعيّ
    """    1. مبدأ الخير العام"""                                     , # مبدأ الخير العام
    """    2. مبدأ الغاية الشّاملة لخيرات الأرض"""                    , # مبدأ الغاية الشّاملة لخيرات الأرض
    """    3. مبدأ اللامركزيّة والتّكامل في اتّخاذ القرار"""          , # مبدأ اللامركزيّة والتّكامل في اتّخاذ القرار
    """    4. مبدأ التّضامن"""                                        , # مبدأ التّضامن
    """    5. مبدأ العدل الاجتماعيّ"""                                , # مبدأ العدل الاجتماعيّ
    """   C. التّنمية البشريّة المتكاملة"""                           , # التّنمية البشريّة المتكاملة
    """   D. اختبار للكنيسة"""                                        , # اختبار للكنيسة

    """  C3. الفصل الثّالث: التّقنيّة والسّيطرة عظمة الإنسان أمام وعود الذّكاء الاصطناعيّ""", # الفصل الثّالث: التّقنيّة والسّيطرة عظمة الإنسان أمام وعود الذّكاء الاصطناعيّ
    """   A. النّموذج التّكنوقراطيّ والسُّلطة الرّقميّة"""            , # النّموذج التّكنوقراطيّ والسُّلطة الرّقميّة
    """   B. الذّكاء الاصطناعيّ"""                                    , # الذّكاء الاصطناعيّ
    """    1. مساعدة قيّمة تتطلّب التّنبّه"""                         , # مساعدة قيّمة تتطلّب التّنبّه
    """    2. مسؤوليّة وشفافيّة وإدارة الذّكاء الاصطناعيّ"""          , # مسؤوليّة وشفافيّة وإدارة الذّكاء الاصطناعيّ
    """   C. ما لا يمكننا أن نفقده"""                                 , # ما لا يمكننا أن نفقده
    """    1. أصول الرّواية: ما بعد الإنسانيّة وما يتجاوز الإنسانيّة""", # أصول الرّواية: ما بعد الإنسانيّة وما يتجاوز الإنسانيّة
    """    2. الحدود، والقلب، وعظمة الإنسان"""                        , # الحدود، والقلب، وعظمة الإنسان
    """   D. ”الشّيء الحقيقيّ الذي هو أكثر من الإنسان“: النّعمة ومذهب الإنسانيّة المسيحيّة""", # ”الشّيء الحقيقيّ الذي هو أكثر من الإنسان“: النّعمة ومذهب الإنسانيّة المسيحيّة
    """   E. مدينتان وحُبّان"""                                       , # مدينتان وحُبّان

    """  C4. الفصل الرّابع: حماية الإنسان في خضمّ التّحوّل الحقيقة، والعمل، والحرّيّة""", # الفصل الرّابع: حماية الإنسان في خضمّ التّحوّل الحقيقة، والعمل، والحرّيّة
    """   A. الحقيقة هي خير عام"""                                    , # الحقيقة هي خير عام
    """    1. الحقيقة والدّيمقراطيّة"""                               , # الحقيقة والدّيمقراطيّة
    """    2. التّواصل والخيال الجماعيّ"""                            , # التّواصل والخيال الجماعيّ
    """    3. من أجل بيئة للتواصل"""                                  , # من أجل بيئة للتواصل
    """    4. تحالف تربويّ للعصر الرّقميّ"""                          , # تحالف تربويّ للعصر الرّقميّ
    """    5. أهمّيّة المدرسة"""                                      , # أهمّيّة المدرسة
    """   B. كرامة العمل في التّحوّل الرّقميّ"""                      , # كرامة العمل في التّحوّل الرّقميّ
    """    1. قيمة العمل"""                                           , # قيمة العمل
    """    2. مشكلة البطالة"""                                        , # مشكلة البطالة
    """    3. اقتصاد يقدّر الكرامة"""                                 , # اقتصاد يقدّر الكرامة
    """    4. العائلة والشّباب: الظّروف الاجتماعيّة للرّجاء"""        , # العائلة والشّباب: الظّروف الاجتماعيّة للرّجاء
    """   C. حماية الحرّيّة من الإدمان ومن أن تصير سلعة وموضوع تجارة""", # حماية الحرّيّة من الإدمان ومن أن تصير سلعة وموضوع تجارة
    """    1. الإدمان والرّقابة الاجتماعيّة"""                        , # الإدمان والرّقابة الاجتماعيّة
    """    2. كسر قيود العبوديّة الجديدة"""                           , # كسر قيود العبوديّة الجديدة
    """   D. مسؤوليّة مشتركة"""                                       , # مسؤوليّة مشتركة

    """  C5. الفصل الخامس: ثقافة القوّة وحضارة المحبّة"""             , # الفصل الخامس: ثقافة القوّة وحضارة المحبّة
    """   A. حضارة المحبّة في العصر الرّقميّ"""                       , # حضارة المحبّة في العصر الرّقميّ
    """   B. ثقافة القوّة"""                                          , # ثقافة القوّة
    """    1. تطبيع الحرب"""                                          , # تطبيع الحرب
    """    2. القوّة بلا حدود"""                                      , # القوّة بلا حدود
    """    3. الأسلحة والذّكاء الاصطناعيّ"""                          , # الأسلحة والذّكاء الاصطناعيّ
    """    4. أزمة التّعدّديّة"""                                     , # أزمة التّعدّديّة
    """    5. واقعيّة سياسيّة مزعومة"""                               , # واقعيّة سياسيّة مزعومة
    """   C. بناء حضارة المحبّة"""                                    , # بناء حضارة المحبّة
    """    1. يمكننا جميعًا أن نؤدّي دورنا"""                         , # يمكننا جميعًا أن نؤدّي دورنا
    """    2. أن ننزع السّلاح من الكلمات"""                           , # أن ننزع السّلاح من الكلمات
    """    3. أن نبني السّلام في العدل"""                             , # أن نبني السّلام في العدل
    """    4. أن ننظر نظرة الضّحايا"""                                , # أن ننظر نظرة الضّحايا
    """    5. أن نربِّيَ واقعيّة سليمة"""                             , # أن نربِّيَ واقعيّة سليمة
    """    6. أن نعيد إطلاق الحوار"""                                 , # أن نعيد إطلاق الحوار
    """    7. ضرورة الدّبلوماسيّة والتّعدّديّة"""                     , # ضرورة الدّبلوماسيّة والتّعدّديّة
    """    8. الصّلاة والرّجاء"""                                     , # الصّلاة والرّجاء

    """  ~ الخاتمة"""                                                 , # الخاتمة
    """   A. الكلمة صار جسدًا"""                                      , # الكلمة صار جسدًا
    """   B. جسد واحد في المسيح"""                                    , # جسد واحد في المسيح
    """   C. ورشة عمل عصرنا"""                                        , # ورشة عمل عصرنا
    """   D. نشيد الرّجاء: نشيد ”تعظّم نفسي الرّبّ“"""                , # نشيد الرّجاء: نشيد ”تعظّم نفسي الرّبّ“
]
